Revit 2027 API
LinePatternElement.SetLinePattern Method
 Sets the LinePattern associated to this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLinePattern(
	LinePattern newLinePattern
)
Public Sub SetLinePattern (
	newLinePattern As LinePattern
)
public:
void SetLinePattern(
	LinePattern^ newLinePattern
)
member SetLinePattern :
        newLinePattern : LinePattern -> unit
Parameters
newLinePattern LinePattern
 The new LinePattern object.
Exceptions
Exception | Condition
ArgumentException |  The Line Pattern is not valid.
ArgumentNullException |  A non-optional argument was null
Remarks
 The data stored inside the input LinePattern will be copied into this element. The input LinePattern itself will not be associated with the element.
See Also
Reference
LinePatternElement Class
Autodesk.Revit.DB Namespace